oc/Mode.org
#+TITLE: Mode

* auto save

#+begin_src emacs-lisp
(require 'auto-save)
(auto-save-enable)
#+end_src

* 一个 buffer 时居中 buffer

#+begin_src emacs-lisp
(centered-window-mode t)
#+end_src


* scratch 默认使用 lisp-interaction-mode

#+begin_src emacs-lisp
(with-current-buffer "*scratch*"
  (lisp-interaction-mode)
    )
#+end_src

* 禁用 Doom 默认删除尾部空格

#+begin_src emacs-lisp
;;(package! ws-butler :disable t)
#+end_src

* 删除空格

#+begin_src emacs-lisp
(add-hook 'switch-buffer-functions
          (lambda (prev curr)
            (cl-assert (eq curr (current-buffer)))  ;; Always t
            (delete-trailing-whitespace)))
;; (save-excursion
;;   (save-restriction
;;     (narrow-to-region 1 (buffer-size switch-buffer-functions--last-buffer))
;;   )
;; )
#+end_src
- [[https://www.gnu.org/software/emacs/manual/html_node/eintr/Buffer-Size-_0026-Locations.html][Buffer Size and the Location of Point]]
- [[https://www.gnu.org/software/emacs/manual/html_node/elisp/Narrowing.html][Narrowing]]

* 网易云音乐

#+begin_src emacs-lisp
(require 'netease-cloud-music)
#+end_src

* elfeed

#+begin_src emacs-lisp
(setq elfeed-feeds
      '(("https://mangatalk.net/feed" mangatalk)
        ))
#+end_src

* alda

#+begin_src emacs-lisp
(setq alda-binary-location "E:/alda/alda.exe")
#+end_src

* ivy

#+begin_src emacs-lisp
(use-package prescient
  :after counsel
  :config
  (prescient-persist-mode 1))

(use-package ivy-prescient
  :after counsel
  :config (ivy-prescient-mode 1)
  )
#+end_src

* ivy posframe
#+begin_src emacs-lisp
(use-package ivy-posframe
  :disabled
  :custom
  (ivy-posframe-width      115)
  (ivy-posframe-min-width  115)
  (ivy-posframe-height     10)
  (ivy-posframe-min-height 10)
  :config
  (setq ivy-posframe-display-functions-alist '((t . ivy-posframe-display-at-frame-center)))
  (setq ivy-posframe-parameters '((parent-frame . nil)
                                  (left-fringe . 8)
                                  (right-fringe . 8)))
  (ivy-posframe-mode 1))
#+end_src
